HeldElement.m_active
Is this held elem active (if false, need to delete any associated elements)

HeldElement.m_elemId
Element id of created element

HeldElement.m_wholeOffset
Offset of the whole held elem

HeldElement.m_instanceInfo
Generic container to hold data specific to an Element class
(m_curve, m_refPoints, etc. and other Beam/Truss-specific stuff
should be moved into one of these)